// 4.Заданы 3 вещественных числа a, b, c (a>0, b>0, c>0).Написать программу, которая выдает существует ли треугольник со сторонами a, b, c.Если существует, то найти каким треугольником он является (прямоугольным, остроугольным, тупоугольным).

using namespace std;
#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian");

    double a, b, c;
    cout << "Введите числа a, b, c: " << endl;
    cin >> a;
    cin >> b;
    cin >> c;

    if ((a + b) <= c || (a + c) <= b || (b + c) <= a) {
        cout << "Треугольник не существует" << endl;
    }
    else {
        cout << "Треугольник существует" << endl;
      
        if (a * a + b * b == c * c || a * a + c * c == b * b || b * b + c * c == a * a) {
            cout << "Треугольник прямоугольный" << endl;
        }
        else if (a * a + b * b > c * c || a * a + c * c > b * b || b * b + c * c > a * a) {
            cout << "Треугольник остроугольный" << endl;
        }
        else {
            cout << "Треугольник тупоугольный" << endl;
        }
    }

    return 0;
}