//5.Дан массив А который состоит из целых чисел.Написать программу, которая находит количество простых элементов массива.Вывести количество простых элементов и сами простые элементы.

using namespace std;
#include <iostream>

bool isPrime(int num) {
    if (num <= 1) return false;
    for (int i = 2; i * i <= num; ++i) {
        if (num % i == 0) return false;
    }
    return true;
}

int main()
{
    setlocale(LC_ALL, "Russian");
 
    int n;
    cout << "Введите размер массива: " << endl;
    cin >> n;

    int* arr = new int[n];

    cout << "Введите элементы массива:" << endl;
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }

    int primeCount = 0;

    cout << "Простые элементы: ";
    for (int i = 0; i < n; ++i) {
        if (isPrime(arr[i])) {
            primeCount++;
            cout << arr[i] << " ";
        }
    }
    cout << endl;

    cout << "Количество простых элементов: " << primeCount << endl;

    return 0;
}